flange-build/flange/components/packages/cardputer-all-in-one/firmware/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
# TinyUSB 接管 native USB；GPIO43 同时是板载扬声器 I2S WS，不能再作为 UART0 TX。
CONFIG_ESP_CONSOLE_NONE=y
CONFIG_FREERTOS_HZ=1000
# TinyUSB vendor 类：esp_tinyusb 用 *_COUNT(int) 启用，>0 即开启 CFG_TUD_VENDOR
# （注：vendor RX/TX bufsize 在 esp_tinyusb tusb_config.h 中硬编码，无 Kconfig 选项）
CONFIG_TINYUSB_VENDOR_COUNT=1
# TinyUSB HID 键盘接口：>0 即开启 CFG_TUD_HID
CONFIG_TINYUSB_HID_COUNT=1
# TinyUSB Audio 无 esp_tinyusb Kconfig，由 main/tinyusb_config/tusb_config.h 统一开启并配置。
